---
kind: type
id: T:Autodesk.Revit.DB.AssemblyType
source: html/19fb680c-cd62-24e4-2e68-45bfc04207d2.htm
---
# Autodesk.Revit.DB.AssemblyType

Type for construction assembly elements.

## Syntax (C#)
```csharp
public class AssemblyType : ElementType
```